---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.AirTerminalCenterNotAligned
source: html/7b6045e4-73c5-83a3-2096-1766c84437b6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.AirTerminalCenterNotAligned Property

The center of the Air Terminal doesn't align at (0,0,0): align the Air Terminal Center to the Origin Defining Reference Planes could help to solve the problem.

## Syntax (C#)
```csharp
public static FailureDefinitionId AirTerminalCenterNotAligned { get; }
```